"""상수 및 좌표 설정(세부 좌표는 수정 필요)"""

from DR_common2 import posx, posj

# 기본 상수
ON, OFF = 1, 0
ROBOT_ID = "dsr01"
ROBOT_MODEL = "m0609"
VELOCITY, ACC = 60, 60  # 속도, 가속도

# 작업 관련 상수
Z_OFFSET = -80  # z축 이동 거리 (mm)
MOVE_DISTANCE = -64  # y축 이동 거리
MOVE_DISTANCE_X = 96  # x축 이동 거리

# 물체 구분
OBJECT_DIV = {
    '2x3': 1,  # 2x3 물체 그립
    '2x2': 2,   # 2x2 물체 그립
    'defect': 3  # 불량품 그립
}

# 초기 좌표
INITIAL_POSE = posj(0, 0, 90, 0, 90, 0)

# 컨테이너 위치
CONTAINER_POSITIONS = [
    posx([281, 275, 103.22, 51.86, -180, 51.93]),  # 1번 컨테이너
    posx([379.02, 270.80, 120.05, 108.41, 179.94, 108.81])   # 2번 컨테이너
]

# 허브 시작 위치
HUB_START_POSITIONS = {
    '2x3': posx([305,  28,  88.00, 51.86, -180, 51.93]),    # 2x3 허브 
    '2x2': posx([307.7, -100.29, 145.94, 165.97, 179.77, 166.57]),   # 2x2 허브
    'defect': posx([500.0, 0.0, 88, 57.85, -178.92, 58.05])     # 불량품 
}

# 허브 작업 영역
HUB_AREAS = {
    '2x3': {
        'start': posx([197.43, 111.77, 61.80, 29.90, 180.00, 29.97]),    # 시작점
        'end': posx([323.22, 12.32, 61.80, 29.90, 180.00, 29.97])      # 끝점
    },
    '2x2': {
        'start': posx([196.40, -17.76, 62.32, 165.54, 179.32, 165.93]),   # 시작점
        'end': posx([308.18, -113.97, 62.32, 165.54, 179.32, 165.93])     # 끝점
    }
}

# 출하 영역 
UNLOAD_AREAS = {
    '2x3': {
        '0': posx([305,  28,  130, 51.86, -180, 51.93]),
        '1': posx([305,  -36,  130, 51.86, -180, 51.93]),
        '2': posx([401,  28,  130, 51.86, -180, 51.93]),
        '3': posx([401,  -36,  130, 51.86, -180, 51.93])
    },
    '2x2': {
        '0': posx([292, -101.5, 130, 168.15, 179.3, 168.47]),
        '1': posx([292, -165.5, 130, 168.15, 179.3, 168.47]),
        '2': posx([388, -101.5, 130, 168.15, 179.3, 168.47]),
        '3': posx([388, -165.5, 130, 168.15, 179.3, 168.47])
    }
}

# 출하 영역 좌표
OUTPUT_POSITION = posx([602.59, 1.55, 130.00, 179.85, -180, 90.24])

# 오버플로우 영역 좌표 
OVERFLOW_POSITION = posx([398.91, 90.05, 33.59, 10.20, 180.00, 10.63])
